#### SolidSolidCutUtils Members

---

|  |
| --- |
| SolidSolidCutUtils Class   Methods   See Also |

The  SolidSolidCutUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddCutBetweenSolids(Document, Element, Element) | Adds a solid-solid cut for the two elements. |
| Public method Static member | AddCutBetweenSolids(Document, Element, Element, Boolean) | Adds a solid-solid cut for the two elements with the option to control splitting of faces of the cutting solid. |
| Public method Static member | CanElementCutElement | Verifies if the cutting element can add a solid cut to the target element. |
| Public method Static member | CutExistsBetweenElements | Checks that if there is a solid-solid cut between two elements. |
| Public method Static member | GetCuttingSolids | Gets all the solids which cut the input element. |
| Public method Static member | GetSolidsBeingCut | Get all the solids which are cut by the input element. |
| Public method Static member | IsAllowedForSolidCut | Validates that the element is eligible for a solid-solid cut. |
| Public method Static member | IsElementFromAppropriateContext | Validates that the element is from an appropriate document. |
| Public method Static member | RemoveCutBetweenSolids | Removes the solid-solid cut between the two elements if it exists. |
| Public method Static member | SplitFacesOfCuttingSolid | Causes the faces of the cutting element where it intersects the element it is cutting to be split or unsplit. |

# See Also

SolidSolidCutUtils Class

Autodesk.Revit.DB Namespace